var gakkou_p=[
"东京大学",
"京都大学",
"大阪大学",
"东北大学",
"北海道大学",
"名古屋大学",
"九州大学",
"东京工业大学",
]
var gakkou_id =[
	"The University of Tokyo",
	"Tohoku University",
	"Kyoto University",
	"Osaka University",
	"Hokkaido University",
	"Nagoya University",
	"Kyushu University",
	"Tokyo Institute of Technology",
]
var gakkou_img= [
	"ryuugaku/dongjin.jpg",
	"ryuugaku/jingdu.jpg",
	"ryuugaku/daban.jpg",
	"ryuugaku/dongbeidaxue.jpg",
	"ryuugaku/beihaidao.jpg",
	"ryuugaku/mingguwu.jpg",
	"ryuugaku/jiuzhou.jpg",
	"ryuugaku/dongjinggonye.jpg",
]
var syoukai =[
	"东京大学（英文：The University of Tokyo；日文平假名：とうきょうだいがく），简称东大（とうだい），是一所本部位于日本东京都文京区的著名研究型综合国立大学，世界百强校。作为日本最高学术殿堂和七所旧帝国大学之首，其在全球都享有极高的声誉。其是国际东亚研究型大学协会、亚洲大学联盟，和国内学术研究恳谈会、超级国际化大学计划、卓越研究生院计划、领先研究生院计划、日瑞Mirai项目成员。<br>东大诞生于1877年，由“东京开成学校”与“东京医学校”在明治维新期间合并改制而成，初设法学、理学、文学、医学四个学部和一所大学预备学校，是日本第一所国立综合性大学，也是亚洲最早的西制大学之一，其部分科系最早可以溯源到灵元天皇时期，作为资本主义文明浪潮冲击下的直接产物，东大在日本社会有着举足轻重的历史性地位。学校于1886年更名为“帝国大学”，这也是日本建立的第一所帝国大学；1897年，其易名为“东京帝国大学”，以区分同年在京都创立的京都帝国大学；二战后的1947年9月，其正式定名为“东京大学”。",
	"京都大学（英语：Kyoto University；日语平假名：きょうとだいがく），简称京大（きょうだい），是一所本部位于京都市左京区的顶尖研究型综合国立大学，近畿地方最高学府，在日本与东京大学齐名的学科齐全、规模宏大的国立综合大学，日本继东京大学之后设立的第二所旧制帝国大学。作为日本最高学府之一，京都大学在全球都享有很高的声望，被誉为“科学家的摇篮”。<br>京都大学创建于1897年，最初名为“京都帝国大学”；二战后，正式更名为“京都大学”；2004年改组为国立大学法人京都大学。京大是东亚研究型大学协会、日英RENKEI成员，日本文部科学省的“超级国际化大学计划”A类顶尖校和指定国立大学、学术研究恳谈会、日本G30、卓越研究生院计划成员。",
	"大阪大学（英文：Osaka University；日语平假名：おおさかだいがく），简称阪大（はんだい），是一所本部位于日本大阪府吹田市的日本顶尖、世界一流的著名研究型综合国立大学，世界百强校，综合实力日本第三，近畿地方和京都大学并列的最高学府，其在全球都享有很高学术声誉。<br>阪大创建于1931年，最初名为大阪帝国大学，是第六所旧帝国大学。二战后，正式更名为大阪大学。大阪大学是日本文部科学省设立的超级国际化大学计划A类顶尖校和指定国立大学，同时也是学术研究恳谈会（RU11）、八大学工学系联合会、卓越研究生院计划、领先研究生院计划，以及国际高校联盟环太平洋大学联盟、东亚研究型大学协会，日英RENKEI等学术组织和项目的重要成员。大阪大学的校友涵盖了日本第一位诺贝尔奖得主，也诞生了沃尔夫奖、拉斯克奖、克拉福德奖、盖尔德纳基金会国际奖、日本国际奖得主等。此外还包括13名校友获日本文化勋章，15名获日本文化功劳勋章，10名获日本学士院恩赐奖，29名获日本学士院奖等。",
	"东北大学（英文：Tohoku University），简称东北大，本部位于日本宫城县仙台市，是一所日本顶尖、世界一流的研究型综合国立大学，世界百强校，日本东北地方最高学府。作为日本旧帝国大学之一，东北大是日本文部科学省指定国立大学和超级国际化大学计划的A类顶尖校，八大学工学系联合会、学术研究恳谈会（RU11）、日本G30、卓越研究生院计划、领先研究生院计划成员，国际高校联盟环太平洋大学联盟、东亚研究型大学协会重要成员，参与日英RENKEI等项目。该校现已涵盖文、理、工、医、农各科。<br>东北大学的前身是旧帝国大学之一的东北帝国大学（1907年成立，原名仙台医科大学）。该校起源于1736年的仙台藩藩校“明伦养贤堂”，东北帝国大学是继东京帝国大学、京都帝国大学之后的第3所旧制帝国大学。1947年10月，东北帝国大学改制为东北大学，成为日本第一所接收女学生和外国学生的大学。2007年，学校举行了100周年校庆。",
	"北海道大学（Hokkaido University；日语平假名：ほっかいどうだいがく），简称北大（ほくだい），是一所本部位于日本北海道札幌市的著名研究型综合国立大学，日本北海道地方最高学府，旧帝国大学之一。该校是日本超级国际化大学计划的A类顶尖校，八大学工学系联合会、学术研究恳谈会成员，入选卓越研究生院计划、领先研究生院计划和日瑞Mirai项目，是日本首座具有授予学士学位资格的一流高等学府。<br>北大创立于1876年，其前身为札幌农学校，是日本最早的高等教育机构。1907年，其被设立为东北帝国大学附属农科大学。1918年，札幌农学校更名为北海道帝国大学。作为七所帝国大学之一，北海道帝国大学是日本设立的第四所帝国大学。1947年，北海道帝国大学更名为北海道大学。2004年，“国立大学法人北海道大学”创建",
	"名古屋大学（英文：Nagoya University；日语平假名：なごやだいがく），简称名大（めいだい），本部位于日本爱知县名古屋市，是一所日本顶尖、世界一流的著名研究型综合国立大学，日本中部地方最高学府。<br>名大创办于1871年。1939年被命名为名古屋帝国大学，为二战结束前日本国内七所帝国大学之一。1947年正式更名为“名古屋大学”。2004年，国立大学法人名古屋大学成立。2020年，国立大学法人东海国立大学机构将成立。该校现拥有10个学部、15个研究科、3个研究所、2所全国共同利用共同研究基地、29处校内共同教育研究设施。作为日本最年轻的旧帝国大学，名大也是环太平洋大学联盟、21世纪学术联盟、全球大学高研院联盟、国际公立大学论坛成员，日本超级国际化大学计划的A类顶尖校，日本指定国立大学、学术研究恳谈会、八大学工学系联合会、卓越研究生院计划、领先研究生院计划等著名组织的成员。",
	"九州大学（英文：Kyushu University；日文平假名：きゅうしゅうだいがく），简称九大（きゅうだい），创立于1903年，是一所本部位于日本福冈县福冈市的顶尖研究型综合国立大学，日本九州地方最高学府，在日本乃至世界上均占有重要的学术地位。该校是日本旧帝国大学和超级国际化大学计划的A类顶尖校之一，学术研究恳谈会、八大学工学系联合会、九州六大学棒球联盟成员，入选日瑞Mirai项目。目前，九大共拥有10个学部、11个研究科、3个研究所和11个研究中心，在校学生约18200名、教职人员4500名，其中国际留学生共1141名。<br>东京帝国大学和京都帝国大学建立后，日本国内就有再在九州建立一所帝国大学的提议。1903年4月，作为京都帝国大学的分部，九大前身的京都帝国大学附属福冈医科大学成立。1911年，其被日本政府单独设立为“九州帝国大学”。二战后的1947年，其被正式定名为“九州大学”.",
	"东京工业大学（Tokyo Institute of Technology），简称东工大（Tokyo Tech），日本国立大学之一，日本顶尖、世界一流的理工科大学。校区位于东京都目黑区与横浜市绿区。东工大是日本超级国际化大学计划A类顶尖校之一，也是指定国立大学、学术研究恳谈会（RU11）、东亚研究型大学协会等组织的重要成员，和七所帝国大学组成了八大学工学系联合会，入选卓越研究生院计划和领先研究生院计划。<br>截至2018年1月，该校共有6个学院，以及科学技术创成研究院、未来产业技术研究所等150余个校内共同教育研究设施。在校本科生4803人，硕士与博士生共计5159人。常任教职员1708人，非常任教职员1839人。师生人数比高达1:6。东工大在人才培养、学术研究和技术创新等方面享有世界声誉。其校友中包括2000年诺贝尔化学奖得主白川英树，2016年诺贝尔生理学或医学奖得主大隅良典等在内的许多著名学者。",
]
function gakkou(num){
	document.getElementById("gakkou_p").innerText = gakkou_p[num-1];
	document.getElementById("gakkou_id").innerText = gakkou_id[num-1];
	document.getElementById("gakkou_img").src =gakkou_img[num-1];
	document.getElementById("syoukai").innerText = syoukai[num-1];
}


window.onload = function(){
	var iCarouselid = window.setInterval("carousel()", 4000);
}
var iCount=1;
function carousel() {
	var sImgSrc = eval("'ryuugaku/gakkou'+iCount.toString()+'.jpg'");
	var sAchange = eval("'a'+iCount.toString()");
	document.getElementById("keshiki").src = sImgSrc;
	iCount = iCount + 1;
	if (iCount == 5) {
		iCount = 1;
	}
}